GeFengthe/RTL8762/board/evb/mesh_provisioner/app/provisioner_app.c
    case GAP_MSG_LE_UPDATE_PASSED_CHANN_MAP:
        APP_PRINT_INFO1("GAP_MSG_LE_UPDATE_PASSED_CHANN_MAP:cause 0x%x",
                        p_data->p_le_update_passed_chann_map_rsp->cause);
        break;
#if F_BT_LE_5_0_SET_PHY_SUPPORT
    case GAP_MSG_LE_PHY_UPDATE_INFO:
        APP_PRINT_INFO4("GAP_MSG_LE_PHY_UPDATE_INFO:conn_id %d, cause 0x%x, rx_phy %d, tx_phy %d",
                        p_data->p_le_phy_update_info->conn_id,
                        p_data->p_le_phy_update_info->cause,
                        p_data->p_le_phy_update_info->rx_phy,
                        p_data->p_le_phy_update_info->tx_phy);
        break;

    case GAP_MSG_LE_REMOTE_FEATS_INFO:
        {
            uint8_t  remote_feats[8];
            APP_PRINT_INFO3("GAP_MSG_LE_REMOTE_FEATS_INFO: conn id %d, cause 0x%x, remote_feats %b",
                            p_data->p_le_remote_feats_info->conn_id,
                            p_data->p_le_remote_feats_info->cause,
                            TRACE_BINARY(8, p_data->p_le_remote_feats_info->remote_feats));
            if (p_data->p_le_remote_feats_info->cause == GAP_SUCCESS)
            {
                memcpy(remote_feats, p_data->p_le_remote_feats_info->remote_feats, 8);
                if (remote_feats[LE_SUPPORT_FEATURES_MASK_ARRAY_INDEX1] & LE_SUPPORT_FEATURES_LE_2M_MASK_BIT)
                {
                    APP_PRINT_INFO0("GAP_MSG_LE_REMOTE_FEATS_INFO: support 2M");
                }
                if (remote_feats[LE_SUPPORT_FEATURES_MASK_ARRAY_INDEX1] & LE_SUPPORT_FEATURES_LE_CODED_PHY_MASK_BIT)
                {
                    APP_PRINT_INFO0("GAP_MSG_LE_REMOTE_FEATS_INFO: support CODED");
                }
            }
        }
        break;
#endif
    default:
        APP_PRINT_ERROR1("app_gap_callback: unhandled cb_type 0x%x", cb_type);
        break;
    }
    return result;
}

/**
 * @brief  Callback will be called when data sent from profile client layer.
 * @param  client_id the ID distinguish which module sent the data.
 * @param  conn_id connection ID.
 * @param  p_data  pointer to data.
 * @retval   result @ref T_APP_RESULT
 */
T_APP_RESULT app_client_callback(T_CLIENT_ID client_id, uint8_t conn_id, void *p_data)
{
    T_APP_RESULT  result = APP_RESULT_SUCCESS;
    APP_PRINT_INFO2("app_client_callback: client_id %d, conn_id %d",
                    client_id, conn_id);
    if (client_id == CLIENT_PROFILE_GENERAL_ID)
    {
        T_CLIENT_APP_CB_DATA *p_client_app_cb_data = (T_CLIENT_APP_CB_DATA *)p_data;
        switch (p_client_app_cb_data->cb_type)
        {
        case CLIENT_APP_CB_TYPE_DISC_STATE:
            if (p_client_app_cb_data->cb_content.disc_state_data.disc_state == DISC_STATE_SRV_DONE)
            {
                APP_PRINT_INFO0("Discovery All Service Procedure Done.");
            }
            else
            {
                APP_PRINT_INFO0("Discovery state send to application directly.");
            }
            break;
        case CLIENT_APP_CB_TYPE_DISC_RESULT:
            if (p_client_app_cb_data->cb_content.disc_result_data.result_type == DISC_RESULT_ALL_SRV_UUID16)
            {
                APP_PRINT_INFO3("Discovery All Primary Service: UUID16 0x%x, start handle 0x%x, end handle 0x%x.",
                                p_client_app_cb_data->cb_content.disc_result_data.result_data.p_srv_uuid16_disc_data->uuid16,
                                p_client_app_cb_data->cb_content.disc_result_data.result_data.p_srv_uuid16_disc_data->att_handle,
                                p_client_app_cb_data->cb_content.disc_result_data.result_data.p_srv_uuid16_disc_data->end_group_handle);
            }
            else
            {
                APP_PRINT_INFO0("Discovery result send to application directly.");
            }
            break;
        default:
            break;
        }

    }
    else if (client_id == prov_client_id)
    {
        prov_client_cb_data_t *pcb_data = (prov_client_cb_data_t *)p_data;
        switch (pcb_data->cb_type)
        {
        case PROV_CLIENT_CB_TYPE_DISC_STATE:
            switch (pcb_data->cb_content.disc_state)
            {
            case PROV_DISC_DONE:
                /* Discovery Simple BLE service procedure successfully done. */
                data_uart_debug("Prov service discovery end!\r\n");
                break;
            case PROV_DISC_FAIL:
                /* Discovery Request failed. */
                data_uart_debug("Prov service discovery fail!\r\n");
                break;
            case PROV_DISC_NOT_FOUND:
                /* Discovery Request failed. */
                data_uart_debug("Prov service not found!\r\n");
                break;
            default:
                break;
            }
            break;
        case PROV_CLIENT_CB_TYPE_READ_RESULT:
            switch (pcb_data->cb_content.read_result.type)
            {
            case PROV_READ_DATA_OUT_CCCD:
                if (pcb_data->cb_content.read_result.cause == 0)
                {
                    data_uart_debug("Prov data out cccd = %d.\r\n",
                                    pcb_data->cb_content.read_result.data.prov_data_out_cccd);
                }
                break;
            default:
                break;
            }
            break;
        case PROV_CLIENT_CB_TYPE_WRITE_RESULT:
            break;
        default:
            break;
        }
    }
    else if (client_id == proxy_client_id)
    {
        proxy_client_cb_data_t *pcb_data = (proxy_client_cb_data_t *)p_data;
        switch (pcb_data->cb_type)
        {
        case PROXY_CLIENT_CB_TYPE_DISC_STATE:
            switch (pcb_data->cb_content.disc_state)
            {
            case PROXY_DISC_DONE:
                /* Discovery Simple BLE service procedure successfully done. */
                data_uart_debug("Proxy service discovery end!\r\n");
                break;
            case PROXY_DISC_FAIL:
                /* Discovery Request failed. */
                data_uart_debug("Proxy service discovery fail!\r\n");
                break;
            case PROXY_DISC_NOT_FOUND:
                /* Discovery Request failed. */
                data_uart_debug("Proxy service not found!\r\n");
                break;
            default:
                break;
            }
            break;
        case PROXY_CLIENT_CB_TYPE_READ_RESULT:
            switch (pcb_data->cb_content.read_result.type)
            {
            case PROXY_READ_DATA_OUT_CCCD:
                if (pcb_data->cb_content.read_result.cause == 0)
                {
                    data_uart_debug("Proxy data out cccd = %d.\r\n",
                                    pcb_data->cb_content.read_result.data.proxy_data_out_cccd);
                }
                break;
            default:
                break;
            }
            break;
        case PROXY_CLIENT_CB_TYPE_WRITE_RESULT:
            break;
        default:
            break;
        }
    }
    else if (client_id == datatrans_client_id)
    {
        datatrans_client_cb_data_t *pdata = p_data;
        switch (pdata->cb_type)
        {
        case DATATRANS_CLIENT_CB_TYPE_DISC_STATE:
            switch (pdata->cb_content.disc_state)
            {
            case DATATRANS_DISC_DONE:
                /** discovery data transmission service procedure successfully done. */
                data_uart_debug("datatrans service discovery end!\r\n");
                break;
            case DATATRANS_DISC_FAIL:
                /** discovery request failed. */
                data_uart_debug("datatrans service discovery fail!\r\n");
                break;
            case DATATRANS_DISC_NOT_FOUND:
                /* discovery request failed. */
                data_uart_debug("datatrans service not found!\r\n");
                break;
            default:
                break;
            }
            break;
        case DATATRANS_CLIENT_CB_TYPE_READ_RESULT:
            switch (pdata->cb_content.read_result.type)
            {
            case DATATRANS_READ_DATA_OUT_CCCD:
                if (0 == pdata->cb_content.read_result.cause)
                {
                    data_uart_debug("datatrans data out cccd = %d.\r\n",
                                    pdata->cb_content.read_result.data.datatrans_data_out_cccd);
                }
                break;
            case DATATRANS_READ_DATA_OUT:
                if (0 == pdata->cb_content.read_result.cause)
                {
                    data_uart_debug("datatrans data out = ");
                    data_uart_dump(pdata->cb_content.read_result.data.value.datatrans_data_out,
                                   pdata->cb_content.read_result.data.value.len);
                }
                break;
            default:
                break;
            }
            break;
        case DATATRANS_CLIENT_CB_TYPE_NOTIF_IND_RESULT:
            data_uart_debug("datatrans notify = ");
            data_uart_dump(pdata->cb_content.notify_indicate_data.value.datatrans_data_out,
                           pdata->cb_content.notify_indicate_data.value.len);
            break;
        case PROV_CLIENT_CB_TYPE_WRITE_RESULT:
            break;
        default:
            break;
        }
    }
    return result;
}

/**
    * @brief    All the BT Profile service callback events are handled in this function
    * @note     Then the event handling function shall be called according to the
    *           service_id
    * @param    service_id  Profile service ID
    * @param    p_data      Pointer to callback data
    * @return   T_APP_RESULT, which indicates the function call is successful or not
    * @retval   APP_RESULT_SUCCESS  Function run successfully
    * @retval   others              Function run failed, and return number indicates the reason
    */
T_APP_RESULT app_profile_callback(T_SERVER_ID service_id, void *p_data)
{
    T_APP_RESULT app_result = APP_RESULT_SUCCESS;
    if (service_id == SERVICE_PROFILE_GENERAL_ID)
    {
        T_SERVER_APP_CB_DATA *p_param = (T_SERVER_APP_CB_DATA *)p_data;
        switch (p_param->eventId)
        {
        case PROFILE_EVT_SRV_REG_COMPLETE:// srv register result event.
            APP_PRINT_INFO1("PROFILE_EVT_SRV_REG_COMPLETE: result %d",
                            p_param->event_data.service_reg_result);
            break;

        case PROFILE_EVT_SEND_DATA_COMPLETE:
            APP_PRINT_INFO5("PROFILE_EVT_SEND_DATA_COMPLETE: conn_id %d, cause 0x%x, service_id %d, attrib_idx 0x%x, credits %d",
                            p_param->event_data.send_data_result.conn_id,
                            p_param->event_data.send_data_result.cause,
                            p_param->event_data.send_data_result.service_id,
                            p_param->event_data.send_data_result.attrib_idx,
                            p_param->event_data.send_data_result.credits);
            if (p_param->event_data.send_data_result.cause == GAP_SUCCESS)
            {
                APP_PRINT_INFO0("PROFILE_EVT_SEND_DATA_COMPLETE success");
            }
            else
            {
                APP_PRINT_ERROR0("PROFILE_EVT_SEND_DATA_COMPLETE failed");
            }
            break;

        default:
            break;
        }
    }
    return app_result;
}

/******************************************************************
 * @fn      device_info_cb
 * @brief   device_info_cb callbacks are handled in this function.
 *
 * @param   cb_data  -  @ref prov_cb_data_t
 * @return  void
 */
void device_info_cb(uint8_t bt_addr[6], uint8_t bt_addr_type, int8_t rssi, device_info_t *pinfo)
{
    if (!dev_info_show_flag)
    {
        return;
    }
    data_uart_debug("bt addr=0x%02x%02x%02x%02x%02x%02x type=%d rssi=%d ", bt_addr[5], bt_addr[4],
                    bt_addr[3], bt_addr[2], bt_addr[1], bt_addr[0], bt_addr_type, rssi);
    switch (pinfo->type)
    {
    case DEVICE_INFO_UDB:
        data_uart_debug("udb=");
        data_uart_dump(pinfo->pbeacon_udb->dev_uuid, 16);
        break;
    case DEVICE_INFO_PROV_ADV:
        data_uart_debug("prov=");
        data_uart_dump(pinfo->pservice_data->provision.dev_uuid, 16);
        break;
    case DEVICE_INFO_PROXY_ADV:
        data_uart_debug("proxy=");
        data_uart_dump((uint8_t *)&pinfo->pservice_data->proxy, pinfo->len);
        break;
    default:
        break;
    }
}

/******************************************************************
 * @fn      prov_cb
 * @brief   Provisioning callbacks are handled in this function.
 *
 * @param   cb_data  -  @ref prov_cb_data_t
 * @return  the operation result
 */
bool prov_cb(prov_cb_type_t cb_type, prov_cb_data_t cb_data)
{
    APP_PRINT_INFO1("prov_cb: type = %d", cb_type);

