GeFengthe/RTL8762/board/evb/mesh_provisioner/app/provisioner_app.c
    switch (cb_type)
    {
    case PROV_CB_TYPE_PB_ADV_LINK_STATE:
        switch (cb_data.pb_generic_cb_type)
        {
        case PB_GENERIC_CB_LINK_OPENED:
            data_uart_debug("PB-ADV Link Opened!\r\n>");
            break;
        case PB_GENERIC_CB_LINK_OPEN_FAILED:
            data_uart_debug("PB-ADV Link Open Failed!\r\n>");
            break;
        case PB_GENERIC_CB_LINK_CLOSED:
            data_uart_debug("PB-ADV Link Closed!\r\n>");
            break;
        default:
            break;
        }
        break;
    case PROV_CB_TYPE_PATH_CHOOSE:
        {
            if (prov_manual)
            {
                /* use cmd "authpath" to select oob/no oob public key and no oob/static oob/input oob/output oob auth data according to the device capabilities */
                prov_capabilities_p pprov_capabilities = cb_data.pprov_capabilities;
                data_uart_debug("prov capabilities: en-%d al-%d pk-%d so-%d os-%d oa-%d is-%d ia-%d\r\n",
                                pprov_capabilities->element_num, pprov_capabilities->algorithm,
                                pprov_capabilities->public_key, pprov_capabilities->static_oob,
                                pprov_capabilities->output_oob_size, pprov_capabilities->output_oob_action,
                                pprov_capabilities->input_oob_size, pprov_capabilities->input_oob_action);
            }
            else
            {
                /* select no oob public key and no oob auth data as default provision method */
                prov_start_t prov_start;
                memset(&prov_start, 0, sizeof(prov_start_t));
                prov_path_choose(&prov_start);
            }
        }
        break;
    case PROV_CB_TYPE_PUBLIC_KEY:
        {
            APP_PRINT_INFO0("prov_cb: get the public key from the device");
            uint8_t public_key[64] = {0xf4, 0x65, 0xe4, 0x3f, 0xf2, 0x3d, 0x3f, 0x1b, 0x9d, 0xc7, 0xdf, 0xc0, 0x4d, 0xa8, 0x75, 0x81, 0x84, 0xdb, 0xc9, 0x66, 0x20, 0x47, 0x96, 0xec, 0xcf, 0x0d, 0x6c, 0xf5, 0xe1, 0x65, 0x00, 0xcc, 0x02, 0x01, 0xd0, 0x48, 0xbc, 0xbb, 0xd8, 0x99, 0xee, 0xef, 0xc4, 0x24, 0x16, 0x4e, 0x33, 0xc2, 0x01, 0xc2, 0xb0, 0x10, 0xca, 0x6b, 0x4d, 0x43, 0xa8, 0xa1, 0x55, 0xca, 0xd8, 0xec, 0xb2, 0x79};
            prov_device_public_key_set(public_key);
        }
        break;
    case PROV_CB_TYPE_AUTH_DATA:
        {
            prov_start_p pprov_start = cb_data.pprov_start;
            prov_auth_value_type = prov_auth_value_type_get(pprov_start);
            /* use cmd to set auth data */
            data_uart_debug("auth method=%d[nsoi] action=%d size=%d type=%d[nbNa]\r\n>",
                            pprov_start->auth_method,
                            pprov_start->auth_action, pprov_start->auth_size, prov_auth_value_type);
            //uint8_t auth_data[16] = {1};
            switch (pprov_start->auth_method)
            {
            case PROV_AUTH_METHOD_STATIC_OOB:
                //prov_auth_value_set(auth_data, sizeof(auth_data));
                APP_PRINT_INFO0("prov_cb: Please share the oob data with the device");
                break;
            case PROV_AUTH_METHOD_OUTPUT_OOB:
                //prov_auth_value_set(auth_data, pprov_start->auth_size.output_oob_size);
                APP_PRINT_INFO2("prov_cb: Please input the oob data provided by the device, output size = %d, action = %d",
                                pprov_start->auth_size.output_oob_size, pprov_start->auth_action.output_oob_action);
                break;
            case PROV_AUTH_METHOD_INPUT_OOB:
                //prov_auth_value_set(auth_data, pprov_start->auth_size.input_oob_size);
                APP_PRINT_INFO2("prov_cb: Please output the oob data to the device, input size = %d, action = %d",
                                pprov_start->auth_size.input_oob_size, pprov_start->auth_action.input_oob_action);
                break;
            default:
                break;
            }
        }
        break;
    case PROV_CB_TYPE_COMPLETE:
        {
            prov_data_p pprov_data = cb_data.pprov_data;
            data_uart_debug("Has provisioned device with addr 0x%04x in %dms!\r\n", pprov_data->unicast_address,
                            plt_time_read_ms() - prov_start_time);
            /* the spec requires to disconnect, but you can remove it as you like! :) */
            prov_disconnect(PB_ADV_LINK_CLOSE_SUCCESS);
        }
        break;
    case PROV_CB_TYPE_FAIL:
        data_uart_debug("provision fail, type=%d!\r\n", cb_data.prov_fail.fail_type);
        break;
    case PROV_CB_TYPE_PROV:
        /* stack ready */
        data_uart_debug("ms addr: 0x%04x\r\n>", mesh_node.unicast_addr);
        break;
    default:
        break;
    }
    return true;
}

/******************************************************************
 * @fn      fn_cb
 * @brief   fn callbacks are handled in this function.
 *
 * @param   frnd_index
 * @param   type
 * @param   fn_addr
 * @return  void
 */
void fn_cb(uint8_t frnd_index, fn_cb_type_t type, uint16_t lpn_addr)
{
    char *string[] = {"establishing with lpn 0x%04x\r\n", "no poll from 0x%04x\r\n", "established with lpn 0x%04x\r\n", "lpn 0x%04x lost\r\n"};
    data_uart_debug(string[type], lpn_addr);
    if (type == FN_CB_TYPE_ESTABLISH_SUCCESS || type == FN_CB_TYPE_FRND_LOST)
    {
        user_cmd_time(NULL);
    }
}

/******************************************************************
 * @fn      hb_cb
 * @brief   heartbeat callbacks are handled in this function.
 *
 * @param   type
 * @param   pdata
 * @return  void
 */
void hb_cb(hb_data_type_t type, void *pargs)
{
    switch (type)
    {
    case HB_DATA_PUB_TIMER_STATE:
        {
            hb_data_timer_state_t *pdata = pargs;
            if (HB_TIMER_STATE_START == pdata->state)
            {
                data_uart_debug("heartbeat publish timer start, period = %d\r\n", pdata->period);
            }
            else
            {
                data_uart_debug("heartbeat publish timer stop\r\n");
            }
        }
        break;
    case HB_DATA_SUB_TIMER_STATE:
        {
            hb_data_timer_state_t *pdata = pargs;
            if (HB_TIMER_STATE_START == pdata->state)
            {
                data_uart_debug("heartbeat subscription timer start, period = %d\r\n", pdata->period);
            }
            else
            {
                data_uart_debug("heartbeat subscription timer stop\r\n");
            }
        }
        break;
    case HB_DATA_PUB_COUNT_UPDATE:
        {
            hb_data_pub_count_update_t *pdata = pargs;
            data_uart_debug("heartbeat publish count update: %d\r\n", pdata->count);
        }
        break;
    case HB_DATA_SUB_PERIOD_UPDATE:
        {
            hb_data_sub_period_update_t *pdata = pargs;
            data_uart_debug("heartbeat subscription period update: %d\r\n", pdata->period);
        }
        break;
    case HB_DATA_SUB_RECEIVE:
        {
            hb_data_sub_receive_t *pdata = pargs;
            data_uart_debug("receive heartbeat: src = %d, init_ttl = %d, features = %d-%d-%d-%d, ttl = %d\r\n",
                            pdata->src, pdata->init_ttl, pdata->features.relay, pdata->features.proxy,
                            pdata->features.frnd, pdata->features.lpn, pdata->ttl);
        }
        break;
    default:
        break;
    }
}
